"""
중앙 집중식 상수 정의 (city-port mapping, 항구 좌표, BADA 포트 ID)
"""

# 지역별 항구 매핑
CITY_PORT_MAPPING = {
    '인천': ['남항(인천항)', '연안부두', '영흥항'],
    '안산': ['오이도항'],
    '화성': ['전곡항'],
    '평택': ['평택항'],
    '당진': ['장고항'],
    '서산': ['삼길포항'],
    '태안': ['마검포항', '모항항', '영목항', '신진도항'],
    '보령': ['오천항', '구매항', '대천항', '무창포항', '남당항', '홍원항'],
    '군산': ['비응항', '야미도항'],
    '격포': ['격포항'],
    '여수': ['돌산항', '국동항', '소호항', '신추항', '종포항', '신월항', '돌산나루터'],
    '고흥': ['녹동방파제']
}

# 항구별 좌표 정보
PORT_COORDINATES = {
    '남항(인천항)': {'lat': 37.47, 'lon': 126.62},
    '연안부두': {'lat': 37.4416, 'lon': 126.6110},
    '영흥항': {'lat': 37.25455083861362, 'lon': 126.49825493353622},
    '오이도항': {'lat': 37.326444939596996, 'lon': 126.65458586308483},
    '전곡항': {'lat': 37.18786766510414, 'lon': 126.65235743282231},
    '평택항': {'lat': 36.96158755929977, 'lon': 126.84006775074936},
    '장고항': {'lat': 37.03122635505709, 'lon': 126.55981703596025},
    '삼길포항': {'lat': 37.00415509197122, 'lon': 126.45292068915825},
    '마검포항': {'lat': 36.61943531903122, 'lon': 126.2875526892295},
    '모항항': {'lat': 36.7759, 'lon': 126.1328},
    '영목항': {'lat': 36.3999, 'lon': 126.4277},
    '신진도항': {'lat': 36.6833, 'lon': 126.1500},
    '오천항': {'lat': 36.4383319, 'lon': 126.5201303},
    '구매항': {'lat': 36.424732, 'lon': 126.432133},
    '대천항': {'lat': 36.3333, 'lon': 126.5167},
    '무창포항': {'lat': 36.2436, 'lon': 126.5469},
    '남당항': {'lat': 36.5390947, 'lon': 126.4689945},
    '홍원항': {'lat': 36.1583, 'lon': 126.5028},
    '비응항': {'lat': 35.93826493213535, 'lon': 126.53099554693064},
    '야미도항': {'lat': 35.8407672, 'lon': 126.488760},
    '격포항': {'lat': 35.6225668, 'lon': 126.4694321},
    '돌산항': {'lat': 34.61326519186631, 'lon': 127.7224984379492},
    '국동항': {'lat': 34.72949367130133, 'lon': 127.7253480879476},
    '소호항': {'lat': 34.746193195297266, 'lon': 127.6561636346259},
    '신추항': {'lat': 34.7308212588099, 'lon': 127.754781729328},
    '종포항': {'lat': 34.73738965299665, 'lon': 127.74701532311137},
    '신월항': {'lat': 34.73, 'lon': 127.74},
    '돌산나루터': {'lat': 34.61, 'lon': 127.72},
    '녹동방파제': {'lat': 34.52298050694286, 'lon': 127.14353349262528},
}

# 바다타임 포트 ID 매핑
BADA_PORT_IDS = {
    '남항(인천항)': 158,
    '연안부두': 158,
    '영흥항': 151,
    '오이도항': 380,
    '전곡항': 618,
    '평택항': 149,
    '장고항': 370,
    '삼길포항': 144,
    '마검포항': 1400,
    '모항항': 134,
    '영목항': 354,
    '신진도항': 965,
    '오천항': 355,
    '구매항': 1385,
    '대천항': 126,
    '무창포항': 236,
    '남당항': 356,
    '홍원항': 523,
    '비응항': 118,
    '야미도항': 348,
    '격포항': 430,
    '돌산항': 270,
    '국동항': 271,
    '소호항': 826,
    '신추항': 885,
    '신월항': 563,
    '종포항': 886,
    '녹동방파제': 443,
}

# 어종 키워드
FISH_KEYWORDS = [
    '주꾸미', '쭈꾸미', '문어', '갑오징어', '우럭', '광어', '낙지', '백조기', '민어',
    '삼치', '쭈갑', '참돔', '갈치', '다운샷', '생미끼', '돌문어', '피문어', '외수질',
    '광어다운샷','한치'
]

# 유효한 배 이름 예외 목록
VALID_SHIP_NAMES = [
    '팀만수', '힐링피싱', '라온피싱', '레드헌터', '레드히어로', '레드썬', '레드퀸', '골드피싱'
]
